Revit 2024 API
FamilyElementVisibility.VisibilityType Property
Indicates if the instance is Model or View specific.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilyElementVisibilityType VisibilityType { get; }
Visual Basic
Public ReadOnly Property VisibilityType As FamilyElementVisibilityType
	Get
Visual C++
public:
property FamilyElementVisibilityType VisibilityType {
	FamilyElementVisibilityType get ();
}
See Also
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace